---
kind: other
id: Methods.T:Autodesk.Revit.UI.DockablePaneId
source: html/61cceab8-8355-caa1-6805-ea9d257d8b27.htm
---
# DockablePaneId Methods

Compares two Guid-based enum object based on their concrete class and GUID value.